In [ ]:
# veri IMP
'''
1.apply
2.concat
3.append
4.merge

'''
# VIMP
# Difference between apply & map

# apply :- apply can be used for 'Series' as well 'DataFrame'
# map :- map use only for 'Series'

In [3]:
# 1. apply :- function to be apply on DataFrame or Column so, apply to be used.

            # 1.it is used on series as well as dataframe
            # 2.it is used on dataframe or perticular column

import pandas as pd

df = pd.DataFrame(
    {'name':['Roshan','Mohan','Kamal','john'],
    'age':[21,20,25,26],
    'sal':[25421,12135,65214,25212]}
)

In [4]:
df

     name  age    sal
0  Roshan   21  25421
1   Mohan   20  12135
2   Kamal   25  65214
3    john   26  25212

In [5]:
# create function for used into apply

def newSal(s):
    return 5000 + s

In [7]:
df['sal'] = df['sal'].apply(newSal)

In [8]:
df

     name  age    sal
0  Roshan   21  30421
1   Mohan   20  17135
2   Kamal   25  70214
3    john   26  30212

In [9]:
py_lst = {
    'price':[150,240,300],
    'qty':[10,20,35],
    'set':[2,7,3]
}

In [10]:
df1 = pd.DataFrame(py_lst)
df1

   price  qty  set
0    150   10    2
1    240   20    7
2    300   35    3

In [13]:
# create function for apply

def newPrice(x):
    return x**2

In [15]:
# apply used on complete DataFrame

df1.apply(newPrice)

   price   qty  set
0  22500   100    4
1  57600   400   49
2  90000  1225    9

In [16]:
df

     name  age    sal
0  Roshan   21  30421
1   Mohan   20  17135
2   Kamal   25  70214
3    john   26  30212

In [18]:
df['name'] = df['name'].apply(lambda x:x.lower())   # lambda function directly used into apply

In [19]:
df

     name  age    sal
0  roshan   21  30421
1   mohan   20  17135
2   kamal   25  70214
3    john   26  30212

In [20]:
df['name'] = df['name'].apply(lambda x:x.upper())

In [21]:
df

     name  age    sal
0  ROSHAN   21  30421
1   MOHAN   20  17135
2   KAMAL   25  70214
3    JOHN   26  30212

In [22]:
lst = {
    'country':['Canada#','USA@','India$'],
    'city':['#Nyk','#Mumbai','*Pune']
}

In [23]:
df2 = pd.DataFrame(lst)
df2

   country     city
0  Canada#     #Nyk
1     USA@  #Mumbai
2   India$    *Pune

In [24]:
import re

In [43]:
def clean(s):
    s = re.sub('[^a-zA-Z0-9 \n\.]', '', s)
    return s

In [44]:
df2

   country     city
0  Canada#     #Nyk
1     USA@  #Mumbai
2   India$    *Pune

In [45]:
df2['country'] = df2['country'].apply(clean)

In [46]:
df2

  country     city
0  Canada     #Nyk
1     USA  #Mumbai
2   India    *Pune

In [47]:
df2['city'] = df2['city'].apply(clean)
df2

  country    city
0  Canada     Nyk
1     USA  Mumbai
2   India    Pune

In [48]:
# append :- append df3 into df2, and index start from 0.

lst = {
    'country':['Brazil#','London@','UK$'],
    'city':['#mongol','#paris','*england']
}

In [49]:
df3 = pd.DataFrame(lst)

In [50]:
df3

   country      city
0  Brazil#   #mongol
1  London@    #paris
2      UK$  *england

In [52]:
df4 = df2.append(df3,ignore_index=True)    # ignore_index work for continuation of index.

C:\Users\Roshan B\AppData\Local\Temp\ipykernel_20756\172335136.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df4 = df2.append(df3,ignore_index=True)

In [53]:
df4['country'] = df4['country'].apply(clean)

In [54]:
df4

  country      city
0  Canada       Nyk
1     USA    Mumbai
2   India      Pune
3  Brazil   #mongol
4  London    #paris
5      UK  *england

In [55]:
df4['city'] = df4['city'].apply(clean)

In [56]:
df4

  country     city
0  Canada      Nyk
1     USA   Mumbai
2   India     Pune
3  Brazil   mongol
4  London    paris
5      UK  england

In [57]:
# concat  :- concat vertically, its concat vertically only when column name same

pd.concat([df2,df3])  # by default axis = 0, it will concat vertically

   country      city
0   Canada       Nyk
1      USA    Mumbai
2    India      Pune
0  Brazil#   #mongol
1  London@    #paris
2      UK$  *england

In [58]:
# concat horizontally

pd.concat([df2,df3],axis = 1)   # axis = 1, it will conact horizantally

  country    city  country      city
0  Canada     Nyk  Brazil#   #mongol
1     USA  Mumbai  London@    #paris
2   India    Pune      UK$  *england

In [59]:
df5 = pd.DataFrame({'population':[1500,255,44445]})
df5

   population
0        1500
1         255
2       44445

In [62]:
pd.concat([df2,df5],axis = 0),   # axis = 0, verticall added

  country    city  population
0  Canada     Nyk         NaN
1     USA  Mumbai         NaN
2   India    Pune         NaN
0     NaN     NaN      1500.0
1     NaN     NaN       255.0
2     NaN     NaN     44445.0

In [65]:
pd.concat([df5,df2,df3],axis = 1)  ,# axis = 1, its cocat horizontally.

   population country    city  country      city
0        1500  Canada     Nyk  Brazil#   #mongol
1         255     USA  Mumbai  London@    #paris
2       44445   India    Pune      UK$  *england